Конфигурация/Documents/ИсходящийДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИсходящийДокумент</Name>
			<BasedOn>
				<xr:Item>Document.ВходящийДокумент</xr:Item>
				<xr:Item>Document.Нарушение</xr:Item>
				<xr:Item>Document.УстранениеНарушения</xr:Item>
				<xr:Item>Document.ВнесениеИзмененийВоВнутреннийПеречень</xr:Item>
				<xr:Item>Catalog.Договоры</xr:Item>
				<xr:Item>Catalog.СчетаДоверительногоУправления</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесениеИзмененийВоВнутреннийПеречень</v8:Type>
						<v8:Type>cfg:DocumentRef.УстранениеНарушения</v8:Type>
						<v8:Type>cfg:DocumentRef.Нарушение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаклейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииУКПИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСобственнойДеятельностиУК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсходящегоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИсходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветПоСуществу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолПолучателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВходящийДокумент</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнесениеИзмененийВоВнутреннийПеречень</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
								<v8:Type>cfg:DocumentRef.УстранениеНарушения</v8:Type>
								<v8:Type>cfg:DocumentRef.Нарушение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ТипыИсходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыИсходящихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОВключенииИнсайдераВСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбИсключенииИнсайдераИзСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИноеУведомлениеИнсайдеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящийДокументДепозитарнойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОКонфликтеИнтересовПредварительное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОКонфликтеИнтересов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ИсходящийДокумент/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.ЗначениеКопирования.Пустая() Тогда
        СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Копирование исходящих документов запрещено!",,,, Отказ);
		Возврат;
    КонецЕсли;
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТипЗнч(ТекущийОбъект.Получатель) = Тип("Строка") И Не ЗначениеЗаполнено(ТекущийОбъект.ПолПолучателя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"При указании получателя строкой необходимо указать пол получателя (Мужской/Женский) для корректного формирования обращения в печатной форме.",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.ЭтоДокументДепозитарнойКомпании Тогда
		
		Если ЗначениеЗаполнено(ЭтаФорма.Основание) Тогда
		
			Если ТекущийОбъект.Основания.Количество() = 0 Тогда
				НоваяСтрока = ТекущийОбъект.Основания.Добавить();
			Иначе
				НоваяСтрока = ТекущийОбъект.Основания[0];
			КонецЕсли; 
			
			НоваяСтрока.Основание = ЭтаФорма.Основание;
			
		Иначе
			
			ТекущийОбъект.Основания.Очистить();
		
		КонецЕсли; 
			
	Иначе
		// проверка получателя
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Основания.Основание КАК Основание,
			|	Основания.НомерСтроки КАК НомерСтроки
			|ПОМЕСТИТЬ _Основания
			|ИЗ
			|	&Основания КАК Основания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Основания.Основание КАК Основание
			|ИЗ
			|	_Основания КАК _Основания
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийДокумент КАК ВходящийДокумент
			|		ПО _Основания.Основание = ВходящийДокумент.Ссылка
			|			И (ВходящийДокумент.Отправитель <> &Получатель)";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Основания", ТекущийОбъект.Основания.Выгрузить());
		Запрос.УстановитьПараметр("Получатель", ТекущийОбъект.Получатель);
		
		Результат = Запрос.Выполнить();
		МассивОснований = Результат.Выгрузить().ВыгрузитьКолонку(0);
		
		Если МассивОснований.Количество() = 0 Тогда
			ТекстПредупреждения = "";
		ИначеЕсли МассивОснований.Количество() = 1 Тогда
			ТекстПредупреждения = "Отправитель запроса ";
		ИначеЕсли МассивОснований.Количество() > 1 Тогда
			ТекстПредупреждения = "Отправители в запросах ";
		КонецЕсли; 
		
		Если ТекстПредупреждения <> "" Тогда
			
			ТекстПредупреждения = "Проверьте получателя ответа." + Символы.ПС + ТекстПредупреждения
				+ СтрСоединить(МассивОснований, ", ") + " отличается от получателя";
			ПараметрыЗаписи.Вставить("ПолучательОтличаетсяОтОтправителя", ТекстПредупреждения);
		
		КонецЕсли; 		
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтаФорма.ИсходнаяДатаДокумента = ТекущийОбъект.Дата;
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Если Объект.Договоры.Количество() > 0 И Элементы.Найти("Договоры") <> Неопределено Тогда
		
		НомерСтроки = Неопределено;
		Если ЗначениеЗаполнено(Элементы.Договоры.ТекущаяСтрока) Тогда
			НомерСтроки = Объект.Договоры.НайтиПоИдентификатору(Элементы.Договоры.ТекущаяСтрока).НомерСтроки;
		КонецЕсли; 
		
		РаботаСДокументооборотом.ЗаполнитьДанныеПоДоговорам(Объект);
		
		Если ЗначениеЗаполнено(НомерСтроки) Тогда
			Для каждого Строка Из Объект.Договоры Цикл
			    Если Строка.НомерСтроки = НомерСтроки Тогда
					Элементы.Договоры.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
					Прервать;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
				
	КонецЕсли; 
	
	Если Не ЭтаФорма.ЭтоДокументДепозитарнойКомпании Тогда
		ЭтаФорма.ВходящиеДокументы.Параметры.УстановитьЗначениеПараметра("Основание", ТекущийОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ПолучательОтличаетсяОтОтправителя") Тогда
		ПоказатьПредупреждение(, ПараметрыЗаписи.ПолучательОтличаетсяОтОтправителя, , "Внимание!");
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.ДатаПриИзменении(ЭтаФорма, "Получатель");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательСоставнойПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиентСервер.УстановитьПараметрыВыбораДоговора(ЭтаФорма, "Получатель");
	РаботаСДокументооборотомКлиент.ПроверитьКорректностьФлаговЛицензий(Объект, "Получатель");
	
КонецПроцедуры
 
&НаКлиенте
Процедура ДоговорыПриИзменении(Элемент)
	РаботаСДокументооборотомКлиентСервер.ЗаполнитьЗаголовокГруппыДоговоров(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументооборотомКлиент.ДоговорыОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыДоговорПриИзменении(Элемент)
	ДоговорыДоговорПриИзмененииНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ТипПолучателяПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.ОбработкаПереключенияТипаЮрФизЛицоСтрока(ЭтаФорма, "ТипПолучателя", "Получатель", Истина);
	УстановитьОбязательностьИВидимостьПолПолучателяНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.СчетДоверительногоУправленияПриИзменении(ЭтаФорма, "Получатель");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипИсполнителяПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.ОбработкаПереключенияТипаЮрФизЛицоСтрока(ЭтаФорма, "ТипИсполнителя", "Исполнитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПодписалПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.ОбработкаПереключенияТипаЮрФизЛицоСтрока(ЭтаФорма, "ТипПодписал", "Подписал");
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Содержание) Или Объект.Содержание = ЭтаФорма.СтандартноеСодержание Тогда
	
		МассивОснований = Новый Массив;
		Для каждого СтрокаОснование Из Объект.Основания Цикл
			МассивОснований.Добавить(СтрокаОснование.Основание);
		КонецЦикла;
		
		Объект.Содержание = ОснованияПриИзмененииНаСервере(Объект.Дата, Объект.Организация, МассивОснований);
		СтандартноеСодержание = Объект.Содержание;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоЛицензииУКПИФПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.ПриИзмененииФлагаЛицензии(Объект, "Получатель", "ПоЛицензииУКПИФ");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоЛицензииДУПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.ПриИзмененииФлагаЛицензии(Объект, "Получатель", "ПоЛицензииДУ");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОбязательностьИВидимостьПолПолучателяНаСервере()
	// Пол получателя показываем и если получатель указан строкой (ТипПолучателя = 2).
	ПолучательСтрокой = (ЭтаФорма.ТипПолучателя = 2);
	ЭлементПолПолучателя = Элементы.Найти("ПолПолучателя");
	Если ЭлементПолПолучателя <> Неопределено Тогда
		ЭлементПолПолучателя.Видимость = ПолучательСтрокой;
	КонецЕсли;
	Если Не ПолучательСтрокой Тогда
		Объект.ПолПолучателя = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаПодборДоговоров(Команда)
	
	РаботаСДокументооборотомКлиент.ПодборДоговоров(ЭтаФорма, Объект.Получатель);
		
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЭтаФорма.ЭтоДокументДепозитарнойКомпании = (Объект.ТипИсходящегоДокумента = Перечисления.ТипыИсходящихДокументов.ИсходящийДокументДепозитарнойКомпании);
	
	ЭтаФорма.ИсходнаяДатаДокумента = Объект.Дата;
	
	Если ЭтаФорма.ЭтоДокументДепозитарнойКомпании Тогда
		
		Элементы.ГруппаВидыДокументов.ТекущаяСтраница = Элементы.ГруппаДепозитарнаяКомпания;
		Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица");
		
		Если Объект.Договоры.Количество() <> 0 Тогда
			ЭтаФорма.СчетДоверительногоУправления = Объект.Договоры[0].Договор;
		КонецЕсли;
		
		Элементы.Основание.ОграничениеТипа = Метаданные.Документы.ИсходящийДокумент.ТабличныеЧасти.Основания.Реквизиты.Основание.Тип;
		Если Объект.Основания.Количество() > 0 Тогда
			ЭтаФорма.Основание = Объект.Основания[0].Основание;
		КонецЕсли; 
			
	Иначе
		
		Если Параметры.Ключ.Пустая()
			И Параметры.ЗначениеКопирования.Пустая() Тогда
			
			ЗаполнитьПодписанта();
			
		КонецЕсли;
		
		ЗаполнитьСписокВыбораТипаИсходящегоДокумента();
		
		РаботаСДокументооборотом.УстановитьПереключательТипаЮрФизЛицоСтрока(ЭтаФорма.ТипПолучателя, Объект.Получатель);
		УстановитьОбязательностьИВидимостьПолПолучателяНаСервере();
		РаботаСДокументооборотом.УстановитьПереключательТипаЮрФизЛицоСтрока(ЭтаФорма.ТипИсполнителя, Объект.Исполнитель);
		РаботаСДокументооборотом.УстановитьПереключательТипаЮрФизЛицоСтрока(ЭтаФорма.ТипПодписал, Объект.Подписал);
		
		РаботаСДокументооборотомКлиентСервер.УстановитьПараметрыВыбораДоговора(ЭтаФорма, "Получатель");
		Элементы.ГруппаВидыДокументов.ТекущаяСтраница = Элементы.ГруппаУправляющаяКомпания;
		Элементы.Номер.Заголовок 	= "Исходящий номер";
		Элементы.Дата.Заголовок 	= "Дата регистрации документа";
		РаботаСДокументооборотом.ЗаполнитьДанныеПоДоговорам(Объект);
		РаботаСДокументооборотомКлиентСервер.ЗаполнитьЗаголовокГруппыДоговоров(ЭтаФорма);
		
		ЭтаФорма.ВходящиеДокументы.Параметры.УстановитьЗначениеПараметра("Основание", Объект.Ссылка);
		
		ЭтаФорма.СтандартноеСодержание = Документы.ИсходящийДокумент.ПолучитьСодержаниеОтветаНаОбращение(Объект.Дата, Объект.Организация, Объект.Основания.Выгрузить( ,"Основание").ВыгрузитьКолонку("Основание"));
		
		Элементы.ГруппаСписокДоговоров.Видимость = (Элементы.Найти("Договоры") <> Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодписанта()

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.КонтактноеЛицо КАК КонтактноеЛицо
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.Объект = &Объект
		|	И КонтактныеЛица.Должность = ""Генеральный директор""";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛИцо"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.Подписал = Выборка.КонтактноеЛицо;
	КонецЕсли

КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОснованияПриИзмененииНаСервере(Период, Организация, МассивОснований)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВходящийДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВходящийДокумент КАК ВходящийДокумент
		|ГДЕ
		|	ВходящийДокумент.Ссылка В(&Ссылка)
		|	И ВходящийДокумент.ТипВходящегоДокумента В (ЗНАЧЕНИЕ(Перечисление.ТипыВходящихДокументов.ОбращениеКлиента), ЗНАЧЕНИЕ(Перечисление.ТипыВходящихДокументов.ОбращениеПотенциальногоКлиента), ЗНАЧЕНИЕ(Перечисление.ТипыВходящихДокументов.ОбращениеИное))";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", МассивОснований);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Возврат Документы.ИсходящийДокумент.ПолучитьСодержаниеОтветаНаОбращение(Период, Организация, МассивОснований);
	
	КонецЕсли;
		
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораТипаИсходящегоДокумента()

	Для каждого ТипДокумента Из Перечисления.ТипыИсходящихДокументов Цикл
		Если ТипДокумента <> Перечисления.ТипыИсходящихДокументов.ИсходящийДокументДепозитарнойКомпании Тогда
			Элементы.ТипИсходящегоДокумента.СписокВыбора.Добавить(ТипДокумента);
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Процедура ДоговорыДоговорПриИзмененииНаСервере()

	РаботаСДокументооборотом.ЗаполнитьДанныеПоДоговорам(Объект, Элементы.Договоры.ТекущаяСтрока);

КонецПроцедуры 

#КонецОбласти
